WATER_PER_KG = 30
CONSTANT_ML = 1000

# Приветствуем пользователя
print('Привет! Я твой цифровой фитнес-трекер, давай знакомиться')

# Спрашиваем имя пользователя, сохраняем в переменную
user_name = input('Как тебя зовут?')

# Спрашиваем возраст пользователя, сохраняем в переменную
user_age = int(input('Сколько тебе лет?'))

# Спрашиваем вес пользователя, сохраняем в переменную
user_weight = float(input('Твой вес, в кг, например, 70.5'))

# Спрашиваем рост пользователя, сохраняем в переменную
user_height = float(input('Твой рост, в м, например, 1.75'))

# Рассчитываем индекс массы тела, сохраняем в переменную
bmi = round(user_weight / (user_height**2), 1)

# Рассчитываем норму воды в миллилитрах, сохраняем в переменную
water_ml = user_weight * WATER_PER_KG

# Переводим норму воды в литры
water_l = water_ml / CONSTANT_ML

# Вывод результатов
print(f'Отчет для пользователя: {user_name} ({user_age} г.)')
print(f'Твой индекс массы тела: {bmi}')
print(f'Рекомендуемая норма воды: {water_l} л. в день')
print('\nРасчет окончен. Будьте здоровы!')
